### TASK 1

In [6]:
import pandas as pd
import datetime

In [10]:
df = pd.read_csv("C:/Users/ADMIN/OneDrive/Desktop/Task 1/attendance_data.csv")  # Replace with your file path

In [11]:
df.shape

(6336, 5)

In [12]:
df.head(3)

        date weekno employee_id             name            status
0  01-Apr-22   W 14   Atq -458@  JESSIE CARRILLO  Work From Office
1  01-Apr-22   W 14    Atq -400      chad macias  Work From Office
2  01-Apr-22   W 14    Atq -437     dallas weeks  Work From Office

## Task 1: Data Cleaning

#### 1. Check for duplicates in the dataset and remove them.

#### 2. Standardize the date values to the format YYYY-MM-DD and extract the month name and day type from them.

In [13]:
df['date'] = pd.to_datetime(df['date'], format='%d-%b-%y')

In [14]:
df['month_name'] = df['date'].dt.strftime('%B')
df['day_type'] = df['date'].dt.strftime('%A')

In [15]:
df['day_category'] = df['date'].dt.strftime('%A').apply(lambda x: 'weekday' if x in ['Monday', 'Tuesday', 'Wednesday', 'Thursday', 'Friday'] else 'weekend')

In [16]:
df.head()

,date,weekno,employee_id,name,status,month_name,day_type,day_category
0,2022-04-01,W 14,Atq -458@,JESSIE CARRILLO,Work From Office,April,Friday,weekday
1,2022-04-01,W 14,Atq -400,chad macias,Work From Office,April,Friday,weekday
2,2022-04-01,W 14,Atq -437,dallas weeks,Work From Office,April,Friday,weekday
3,2022-04-01,W 14,Atq -369,GRETA HORTON,Work From Office,April,Friday,weekday
4,2022-04-01,W 14,Atq -374,KALEY FITZPATRICK,Work From Office,April,Friday,weekday

#### 3.Remove any extra characters, such as special characters, from the employee ID values. Some IDs may contain a '@' character at the end, which can be cleaned and brought to a common format.

In [17]:
df['employee_id'] = df['employee_id'].str.replace('@', '')

In [18]:
df.head(2)

,date,weekno,employee_id,name,status,month_name,day_type,day_category
0,2022-04-01,W 14,Atq -458,JESSIE CARRILLO,Work From Office,April,Friday,weekday
1,2022-04-01,W 14,Atq -400,chad macias,Work From Office,April,Friday,weekday

#### 4.Standardize the capitalization of names. Convert all names to title case, which means capitalizing the first letter of each word.

In [19]:
df['name'] = df['name'].str.title()
df.head(2)

,date,weekno,employee_id,name,status,month_name,day_type,day_category
0,2022-04-01,W 14,Atq -458,Jessie Carrillo,Work From Office,April,Friday,weekday
1,2022-04-01,W 14,Atq -400,Chad Macias,Work From Office,April,Friday,weekday

In [20]:
print(df.columns)

Index(['date', 'weekno', 'employee_id', 'name', 'status', 'month_name',
       'day_type', 'day_category'],
      dtype='object')

#### 5.Map the corresponding values in the status column with the given abbreviations:
#### Work From Office --> WFO
#### Work From Home --> WFH
#### Birthday Leave --> BL
#### Menstrual Leave --> ML
#### Paid Leave --> PL
#### Sick Leave --> SL
#### Weekly Off --> WO

In [21]:
# Create a dictionary to map status values to abbreviations
abbreviations_dict = {
    'Work From Office': 'WFO',
    'Work From Home': 'WFH',
    'Birthday Leave': 'BL',
    'Menstrual Leave': 'ML',
    'Paid Leave': 'PL',
    'Sick Leave': 'SL',
    'Weekly Off': 'WO'
}

# Apply the mapping to create the new column
df['abbreviations'] = df['status'].map(abbreviations_dict)

In [44]:
df.head(3)

,date,weekno,month_name,day_type,day_category,employee_id,name,status,abbreviations
0,2022-04-01,W 14,April,Friday,weekday,Atq -458,Jessie Carrillo,Work From Office,WFO
1,2022-04-01,W 14,April,Friday,weekday,Atq -400,Chad Macias,Work From Office,WFO
2,2022-04-01,W 14,April,Friday,weekday,Atq -437,Dallas Weeks,Work From Office,WFO

In [45]:
desired_order = ['date', 'weekno', 'month_name', 'day_type', 'day_category', 'employee_id', 'name', 'status', 'abbreviations']
df = df[desired_order]
df.head(3)

,date,weekno,month_name,day_type,day_category,employee_id,name,status,abbreviations
0,2022-04-01,W 14,April,Friday,weekday,Atq -458,Jessie Carrillo,Work From Office,WFO
1,2022-04-01,W 14,April,Friday,weekday,Atq -400,Chad Macias,Work From Office,WFO
2,2022-04-01,W 14,April,Friday,weekday,Atq -437,Dallas Weeks,Work From Office,WFO

## Task 2: Ad Hoc aka Analysis

#### 1.What is the total count of distinct employee names within the dataset?

In [46]:
total_distinct_names = df['name'].nunique()
total_distinct_names

99

In [47]:
df_may = df[df['month_name'] == 'May']

# Count occurrences of WFH status
wfh_count = df_may[df_may['status'] == 'Work From Home'].shape[0]

# Calculate total records
total_records = df_may.shape[0]

# Calculate WFH percentage
wfh_percentage = round(((wfh_count / total_records) * 100),2)
wfh_percentage

7.39

In [48]:

df_may = df[df['month_name'] == 'May']

# Count occurrences of Work From Home (WFH) status using 'abbreviations' column
wfh_count = df_may[df_may['abbreviations'] == 'WFH'].shape[0]

# Calculate total records (total present days in May)
total_records = df_may.shape[0]

# Calculate WFH percentage
wfh_percentage = round(((wfh_count / total_records) * 100), 2) if total_records > 0 else 0

wfh_percentage  # This should give you the expected WFH percentage for May

7.39

In [49]:
df_june = df[df['date'].dt.month == 6]

In [52]:
# Check the columns in your DataFrame
print(attendance_data.columns)

Index(['date', 'weekno', 'employee_id', 'name', 'status'], dtype='object')